----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1      [-1, 64, 8, 150, 150]          28,224
       BatchNorm3d-2      [-1, 64, 8, 150, 150]             128
              ReLU-3      [-1, 64, 8, 150, 150]               0
      Conv3DSimple-4      [-1, 64, 8, 150, 150]         110,592
       BatchNorm3d-5      [-1, 64, 8, 150, 150]             128
              ReLU-6      [-1, 64, 8, 150, 150]               0
      Conv3DSimple-7      [-1, 64, 8, 150, 150]         110,592
       BatchNorm3d-8      [-1, 64, 8, 150, 150]             128
              ReLU-9      [-1, 64, 8, 150, 150]               0
       BasicBlock-10      [-1, 64, 8, 150, 150]               0
     Conv3DSimple-11      [-1, 64, 8, 150, 150]         110,592
      BatchNorm3d-12      [-1, 64, 8, 150, 150]             128
             ReLU-13      [-1, 64, 8, 150, 150]               0
     Conv3DSimple-14      [-1, 64, 8, 150, 150]         110,592
      BatchNorm3d-15      [-1, 64, 8, 150, 150]             128
             ReLU-16      [-1, 64, 8, 150, 150]               0
       BasicBlock-17      [-1, 64, 8, 150, 150]               0
     Conv3DSimple-18       [-1, 128, 4, 75, 75]         221,184
      BatchNorm3d-19       [-1, 128, 4, 75, 75]             256
             ReLU-20       [-1, 128, 4, 75, 75]               0
     Conv3DSimple-21       [-1, 128, 4, 75, 75]         442,368
      BatchNorm3d-22       [-1, 128, 4, 75, 75]             256
           Conv3d-23       [-1, 128, 4, 75, 75]           8,192
      BatchNorm3d-24       [-1, 128, 4, 75, 75]             256
             ReLU-25       [-1, 128, 4, 75, 75]               0
       BasicBlock-26       [-1, 128, 4, 75, 75]               0
     Conv3DSimple-27       [-1, 128, 4, 75, 75]         442,368
      BatchNorm3d-28       [-1, 128, 4, 75, 75]             256
             ReLU-29       [-1, 128, 4, 75, 75]               0
     Conv3DSimple-30       [-1, 128, 4, 75, 75]         442,368
      BatchNorm3d-31       [-1, 128, 4, 75, 75]             256
             ReLU-32       [-1, 128, 4, 75, 75]               0
       BasicBlock-33       [-1, 128, 4, 75, 75]               0
     Conv3DSimple-34       [-1, 256, 2, 38, 38]         884,736
      BatchNorm3d-35       [-1, 256, 2, 38, 38]             512
             ReLU-36       [-1, 256, 2, 38, 38]               0
     Conv3DSimple-37       [-1, 256, 2, 38, 38]       1,769,472
      BatchNorm3d-38       [-1, 256, 2, 38, 38]             512
           Conv3d-39       [-1, 256, 2, 38, 38]          32,768
      BatchNorm3d-40       [-1, 256, 2, 38, 38]             512
             ReLU-41       [-1, 256, 2, 38, 38]               0
       BasicBlock-42       [-1, 256, 2, 38, 38]               0
     Conv3DSimple-43       [-1, 256, 2, 38, 38]       1,769,472
      BatchNorm3d-44       [-1, 256, 2, 38, 38]             512
             ReLU-45       [-1, 256, 2, 38, 38]               0
     Conv3DSimple-46       [-1, 256, 2, 38, 38]       1,769,472
      BatchNorm3d-47       [-1, 256, 2, 38, 38]             512
             ReLU-48       [-1, 256, 2, 38, 38]               0
       BasicBlock-49       [-1, 256, 2, 38, 38]               0
     Conv3DSimple-50       [-1, 512, 1, 19, 19]       3,538,944
      BatchNorm3d-51       [-1, 512, 1, 19, 19]           1,024
             ReLU-52       [-1, 512, 1, 19, 19]               0
     Conv3DSimple-53       [-1, 512, 1, 19, 19]       7,077,888
      BatchNorm3d-54       [-1, 512, 1, 19, 19]           1,024
           Conv3d-55       [-1, 512, 1, 19, 19]         131,072
      BatchNorm3d-56       [-1, 512, 1, 19, 19]           1,024
             ReLU-57       [-1, 512, 1, 19, 19]               0
       BasicBlock-58       [-1, 512, 1, 19, 19]               0
     Conv3DSimple-59       [-1, 512, 1, 19, 19]       7,077,888
      BatchNorm3d-60       [-1, 512, 1, 19, 19]           1,024
             ReLU-61       [-1, 512, 1, 19, 19]               0
     Conv3DSimple-62       [-1, 512, 1, 19, 19]       7,077,888
      BatchNorm3d-63       [-1, 512, 1, 19, 19]           1,024
             ReLU-64       [-1, 512, 1, 19, 19]               0
       BasicBlock-65       [-1, 512, 1, 19, 19]               0
AdaptiveAvgPool3d-66         [-1, 512, 1, 1, 1]               0
           Linear-67                  [-1, 400]         205,200
================================================================
Total params: 33,371,472
Trainable params: 33,371,472
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8.24
Forward/backward pass size (MB): 1958.52
Params size (MB): 127.30
Estimated Total Size (MB): 2094.06
----------------------------------------------------------------